{"pages":[{"url":"http://www.hualinluan.com/pages/about/","text":"我就是我 性别： 男 爱好： 女 爱好后端技术，尤爱分布式架构（存储/调度/计算)，喜java/python,会点C/C++/Perl/Shell/Scheme/Scala","tags":"about","title":"About"},{"url":"http://www.hualinluan.com/articles/2016/02/17/say hello/","text":"写在前面 我这个人很懒，也很普通，在社交媒体上基本就是潜水+看客。但今天，我决定做一些改变，这么年的经历，是时候迈出一步，做更好的积累和沉淀了。 用正确的方式，让自己变得更好。","tags":"Misc","title":"Say Hello"},{"url":"http://www.hualinluan.com/articles/2013/08/27/elegant-best-pelican-theme-features/","text":"[Note] This article is forwared from oncrashreboot.com , just to verify my elegant settings. Elegant is a stylish, responsive, and minimal Pelican theme that looks amazing across all screen resolutions and devices. Elegant gives meaning to the expression \"sand the under side of the drawer.\" Every feature and style of Elegant is the result of a long thought process. Get Elegant 1.3 License Agreement | Release Notes Show your support. Leave a tip! What makes Elegant so special? Search Static sites usually do not offer search. Elegant uses Tipue Search - an open source jQuery plugin, to offer search for your static site. There are two search modes. JSON Mode Your site pages will be stored in JSON at your server. Tipue Search will use AJAX to access it and render search result. You need Tipue Search plugin to use this mode. Live Mode Search Tipue Search will fetch your site using Sitemap, index it and store it in the visitor's cache. This mode requires Sitemap plugin . Use JSON mode if you value speed, or have a large site, or don't want to overwhelm your host server for every search query. Here is how the search result looks like Search box is part of main navigation menu so that visitor can search from any page. Live Filter for Tags Elegant is a minimal theme. Instead of creating separate pages for each tag, Elegant shows all the tags on a single page. To help visitor find the tags he is interested in, Elegant offers live filter. Go to tags page and type your required tag in \"Find a tag\" search box. Elegant will automatically filter the list. For example, this is how my tags page looks like As soon as I type \"os\", all other tags are filtered out With live filter, your reader will have no difficulty in picking up his desired tag from the list, even if your site has hundreds of tags. All Categories but with zero clutter Pelican by default creates a separate page for each category. Themes list all the articles filed in that category at its page. Elegant takes a different approach. It lists all the categories and their articles on the same page. To reduce clutter and utilise space efficiently, each category and its list of articles in enclosed in collapsible accordions . Here is how categories appear collapsed And this is how they appear uncollapsed Did you notice that categories are listed in ascending alphabetical order and articles are sorted by their date in descending order? Home Page Features This is the page that visitors see when they open your website. Your chance to make a good and lasting first impression. Most sites just display a list of recent posts. Elegant goes the extra mile. Check this out You can see two sections here, About me My Projects There is a third section below these two sections, \"Recent articles\" About me You can write up your own About me section using LANDING_PAGE_ABOUT variable in your configuration. It is a dictionary that has two keys title and details . Value of title is displayed in the header of the home page, like in the above example it is \"I design and build software products for iOS and OSX\". details is the text that appears under \"About me\" heading. Projects Projects list is read from PROJECTS . It is an array of dictionaries. Each dictionary has three keys, name which will have name of your project, url which will have URL of the project, and description which will have the description of the project. You can define as many projects as you want. Here is an example, 1 2 3 4 5 6 7 8 9 PROJECTS = [{ 'name' : 'Logpad + Duration' , 'url' : 'https://github.com/talha131/logpad-plus-duration#logpad--duration' , 'description' : 'Vim plugin to emulate Windows Notepad logging feature,' ' and log duration of each entry' }, { 'name' : 'Elegant Theme for Pelican' , 'url' : 'http://oncrashreboot.com/pelican-elegant' , 'description' : 'A clean and distraction free theme, with search and a' ' lot more unique features, using Jinja2 and Bootstrap' }] Recent Articles Recent articles show last RECENT_ARTICLES_COUNT whose default value is 10. It also has a link to \"all posts\". Mailchimp Mailchimp has become the preferred newsletter service. Elegant shows a form to subscribe to your newsletter, above the fold, in the right section of every article. Increased visibility is said to increase number of subscribers. You need to put your Mailchimp form action URL in MAILCHIMP_FORM_ACTION in your configuration file. You can also define EMAIL_SUBSCRIPTION_LABEL , EMAIL_FIELD_PLACEHOLDER and SUBSCRIBE_BUTTON_TITLE to customize user experience. Collapsible Comments Readers use scroll bar to track their progress when reading inside their browsers. Very often comments take up more space than the actual article. When comments take up more space, it throws the scroll bar proportion off and reader cannot judge his progress correctly. Hacker News hosted a discussion on this topic. tons of online articles list comments on the same page, so the scroll bar is almost a negative incentive to keep reading. \"I've read this much of the article and I'm only 1/20th of the way down?\" [user stops reading, unaware that there's 450 comments and the article is actually pretty short] Elegant keeps the comments section hidden by default. Reader can hide and unhide the section by clicking on the comments section. This is how comments section appear It expands when reader clicks on it Articles Count with every Tag and Category Readers of an article on your site usually look for other articles on the same topic. Categories and tags are a way of showing them related articles. Elegant displays the count of articles that you have written in a category or tag in a non-intrusive manner. Every category and tag has the count of articles in superscript. So if you have written three articles in the C++ category or tag, it will have 3 in the superscript. This way visitor will know you have written other articles too on the same topic. Check out the screenshots, Custom 404 Page Elegant has a custom Error 404 page for your readers. Page Title Elegant follows following format for the <title> tag Article title · Site Name Some sites put site title first and article title later in the <title> tag. There is a problem with this approach. When you open too many tabs, browser delimits tab's title from the end. In such cases, only the first few words or even letters of the <title> are left visible. If visitor has opened several tabs from your website, all tabs will have \"Site Name...\" title. User will need to click on each tab to identify his required tab from the content. But with Elegant's approach article title will always be visible, and reader will have less difficultly in identifying the tab he is after. Putting site title before the article title increases your site name visibility. Elegant achieves this by putting site name in the top navigation bar of every page, where it always stays above the fold. Code Style Elegant uses Solarized theme for syntax highlighting. Line numbers have a different background color so that they appear distinct from the code. Here is an example 1 2 3 4 int sample_function ( void ) { printf ( \"This is a sample function\" ); return 0 } Article Subtitle Pelican lets you define title of your article in the meta data. Elegant adds subtitle support. Just define subtitle in your article's meta data and it will appear along with your title. Here is an example, Article subtitle is displayed with the title in every list. To keep it visibly separate from title, subtitle is enclosed in <small> tag. When visible cue cannot be used, like in the title attribute of html anchor tag <a> , a hyphen is inserted between them. Elegant - Technical Nitty-Gritty License The license requires that you give credit to me, Talha Mansoor, as the author of the Elegant theme on every site that uses this theme. I have placed the attribution in the footer of every page. Do not remove it. If you need to remove or change the style of the attribution, please get in touch with me first. Along with this attribution clause, Elegant theme is licensed under The MIT License. If you use my theme, I would love to hear from you. Get in touch and let me know about it. I may link to your site too. Contribute Front end design is not my strong suite. I must have made some blunders in this design unknowingly. Please don't let me go away with buggy code. File bugs at Github issues Share your ideas about the design in the comments below And most of all contribute improvements to this project There are two problem areas that I can think of, Internet Explorer support Web safe fonts. I developed this theme on a MacBook Retina. Although I have tried to make sure it looks great on all platforms but it still needs polish Besides these, there must be other bugs that I haven't noticed yet. I need your help to hunt them down and make them behave.","tags":"Elegant - Pelican Theme","title":"Elegant"}]}